k6/cached-test2.txt
100 blocks: no issues in backend. just reading off cache
a2k@A2K:~/dev/rust/api2/k6$ k6 run 2-moreBlocks.js --duration 10s

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: 2-moreBlocks.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 40s max duration (incl. graceful stop):
           * default: 1 looping VUs for 10s (gracefulStop: 30s)


     data_received..................: 2.7 kB 270 B/s
     data_sent......................: 1.5 kB 146 B/s
     http_req_blocked...............: avg=23.74µs  min=4.33µs   med=9.53µs   max=153.03µs p(90)=26.61µs  p(95)=89.82µs 
     http_req_connecting............: avg=8.45µs   min=0s       med=0s       max=84.58µs  p(90)=8.45µs   p(95)=46.52µs 
     http_req_duration..............: avg=2.22ms   min=1.03ms   med=2.41ms   max=3.18ms   p(90)=2.54ms   p(95)=2.86ms  
       { expected_response:true }...: avg=2.22ms   min=1.03ms   med=2.41ms   max=3.18ms   p(90)=2.54ms   p(95)=2.86ms  
     http_req_failed................: 0.00%  ✓ 0        ✗ 10 
     http_req_receiving.............: avg=116.75µs min=46.36µs  med=117.94µs max=161.05µs p(90)=160.24µs p(95)=160.64µs
     http_req_sending...............: avg=44.83µs  min=15.75µs  med=48.16µs  max=52.44µs  p(90)=51.91µs  p(95)=52.17µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=2.06ms   min=975.59µs med=2.22ms   max=3.02ms   p(90)=2.38ms   p(95)=2.7ms   
     http_reqs......................: 10     0.996861/s
     iteration_duration.............: avg=1s       min=1s       med=1s       max=1s       p(90)=1s       p(95)=1s      
     iterations.....................: 10     0.996861/s
     vus............................: 1      min=1      max=1
     vus_max........................: 1      min=1      max=1


running (10.0s), 0/1 VUs, 10 complete and 0 interrupted iterations
default ✓ [======================================] 1 VUs  10s



-----------------------------------------------------------
1000 blocks:



Error fetching logs: error sending request for url (https://eth-mainnet.g.alchemy.com/v2/84GnvlKF-rAfskHdmivKpipIoSLF033I): error trying to connect: tcp open error: Too many open files (os error 24)
This only popped up once. Other than that, seemed to work fine.

a2k@A2K:~/dev/rust/api2/k6$ k6 run 2-moreBlocks.js --duration 10s

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: 2-moreBlocks.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 40s max duration (incl. graceful stop):
           * default: 1 looping VUs for 10s (gracefulStop: 30s)


     data_received..................: 2.7 kB 271 B/s
     data_sent......................: 1.5 kB 146 B/s
     http_req_blocked...............: avg=22.5µs   min=3.03µs   med=4.31µs   max=184.7µs  p(90)=26.68µs p(95)=105.69µs
     http_req_connecting............: avg=12.7µs   min=0s       med=0s       max=127.03µs p(90)=12.7µs  p(95)=69.86µs 
     http_req_duration..............: avg=967.99µs min=542.35µs med=812.77µs max=2.25ms   p(90)=1.47ms  p(95)=1.86ms  
       { expected_response:true }...: avg=967.99µs min=542.35µs med=812.77µs max=2.25ms   p(90)=1.47ms  p(95)=1.86ms  
     http_req_failed................: 0.00%  ✓ 0       ✗ 10 
     http_req_receiving.............: avg=56.02µs  min=35.75µs  med=47.64µs  max=122.53µs p(90)=74.8µs  p(95)=98.66µs 
     http_req_sending...............: avg=26.4µs   min=11.08µs  med=18.75µs  max=53.23µs  p(90)=45.24µs p(95)=49.23µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=885.57µs min=495.51µs med=735.94µs max=2.09ms   p(90)=1.37ms  p(95)=1.73ms  
     http_reqs......................: 10     0.99817/s
     iteration_duration.............: avg=1s       min=1s       med=1s       max=1s       p(90)=1s      p(95)=1s      
     iterations.....................: 10     0.99817/s
     vus............................: 1      min=1     max=1
     vus_max........................: 1      min=1     max=1


running (10.0s), 0/1 VUs, 10 complete and 0 interrupted iterations
default ✓ [======================================] 1 VUs  10s


----------------------------------------------------------

5k blocks:
getting more errors like  these..
Error fetching logs: error sending request for url (https://eth-mainnet.g.alchemy.com/v2/84GnvlKF-rAfskHdmivKpipIoSLF033I): error trying to connect: dns error: Device or resource busy (os error 16)
Error fetching logs: error sending request for url (https://eth-mainnet.g.alchemy.com/v2/84GnvlKF-rAfskHdmivKpipIoSLF033I): error trying to connect: tcp open error: Too many open files (os error 24)

a2k@A2K:~/dev/rust/api2/k6$ k6 run 2-moreBlocks.js --duration 10s

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: 2-moreBlocks.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 40s max duration (incl. graceful stop):
           * default: 1 looping VUs for 10s (gracefulStop: 30s)


     data_received..................: 2.7 kB 270 B/s
     data_sent......................: 1.5 kB 146 B/s
     http_req_blocked...............: avg=21.84µs min=3.86µs   med=8.65µs  max=150.6µs  p(90)=27.4µs  p(95)=89µs    
     http_req_connecting............: avg=9.88µs  min=0s       med=0s      max=98.8µs   p(90)=9.88µs  p(95)=54.34µs 
     http_req_duration..............: avg=1.55ms  min=579.95µs med=1.27ms  max=2.78ms   p(90)=2.62ms  p(95)=2.7ms   
       { expected_response:true }...: avg=1.55ms  min=579.95µs med=1.27ms  max=2.78ms   p(90)=2.62ms  p(95)=2.7ms   
     http_req_failed................: 0.00%  ✓ 0        ✗ 10 
     http_req_receiving.............: avg=94.03µs min=34.45µs  med=82.97µs max=163.01µs p(90)=149.3µs p(95)=156.16µs
     http_req_sending...............: avg=34.08µs min=12.98µs  med=36.78µs max=67.45µs  p(90)=51.01µs p(95)=59.23µs 
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=1.43ms  min=531.93µs med=1.16ms  max=2.61ms   p(90)=2.41ms  p(95)=2.51ms  
     http_reqs......................: 10     0.997728/s
     iteration_duration.............: avg=1s      min=1s       med=1s      max=1s       p(90)=1s      p(95)=1s      
     iterations.....................: 10     0.997728/s
     vus............................: 1      min=1      max=1
     vus_max........................: 1      min=1      max=1


running (10.0s), 0/1 VUs, 10 complete and 0 interrupted iterations
default ✓ [======================================] 1 VUs  10s